twitter/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def current_user
    token = request.headers['Authorization'].presence
    @current_user ||= User.find_by_auth_token(token) if token