twitter/app/models/user.rb

  def generate_auth_token!
    begin
      self.auth_token = Devise.friendly_token
    end while self.class.exists?(auth_token: auth_token)
---
SELECT 1 AS one FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "[FILTERED]"], ["LIMIT", 1]]